app/Controllers/Canchas.php

SELECT *
FROM `canchas`
---
    public function index()
    {
        $model = new CanchasModel(); // Aquí debe ser "CanchasModel" en lugar de "CanchaModel"
        $canchas = $model->findAll();